# Архангельское месторождение, книга 1
content_a1 = [(43, 47, 0),
              (48, 49, 1),
              (50, 67, 2),
              (68, 78, 3),
              (79, 102, 4),
              (103, 181, 5),
              (182, 286, 6),
              (287, 293, 7)]
# Архангельское месторождение, книга 2
content_a2 = [(12, 62, 8),
              (63, 72, 9),
              (73, 79, 10),
              (80, 105, 11),
              (106, 152, 11),
              (153, 167, 12),
              (168, 228, 13)]
# Ивинское месторождение, книга 1
content_i1 = [(31, 33, 0),
              (34, 36, 1),
              (37, 143, 2),
              (144, 196, 3),
              (197, 276, 4),
              (277, 289, 5),
              (290, 308, 6),
              (309, 335, 7),
              (336, 349, 8),
              (350, 381, 9),
              (382, 407, 10),
              (408, 419, 11),
              (420, 431, 12),
              (432, 454, 13),
              (455, 459, 14)]
# Щербеньское, книга 1
content_sh1 = [(14, 15, 0),
               (16, 18, 1),
               (19, 63, 2),
               (64, 80, 3),
               (81, 97, 4),
               (98, 124, 5),
               (125, 130, 6),
               (131, 151, 7),
               (152, 158, 8),
               (159, 178, 9),
               (179, 196, 10),
               (197, 206, 11),
               (207, 217, 12),
               (218, 237, 13),
               (238, 247, 14)]
# Байданкинское, книга 1
content_b1 = [(33, 35, 0),
              (36, 38, 1),
              (39, 79, 2.1),
              (80, 100, 2.2),
              (101, 136, 2.3),
              (137, 169, 3),
              (170, 232, 4),
              (233, 246, 5)]
# Байданкинское, книга 2
content_b2 = [(8, 18, 6),
              (19, 41, 7),
              (42, 79, 8.1),
              (80, 100, 8.2),
              (101, 119, 8.3),
              (120, 139, 8.4),
              (140, 159, 8.5),
              (160, 179, 8.6),
              (180, 199, 8.7),
              (200, 236, 8.8),
              (237, 263, 9),
              (264, 279, 10),
              (280, 288, 11),
              (289, 295, 12),
              (296, 310, 13),
              (311, 311, 14)]
# Аканское
content_ac = [(19, 21, 0),
              (22, 44, 1),
              (45, 55, 2),
              (56, 105, 3),
              (106, 170, 4),
              (171, 187, 5),
              (188, 189, 6)]
# Граничное, книга 1
content_g1 = [(26, 28, 0),
              (29, 31, 1),
              (32, 60, 2.1),
              (61, 101, 2.2),
              (102, 142, 2.3),
              (143, 184, 3),
              (185, 235, 4),
              (236, 252, 5)]
# Граничное, книга 2
content_g2 = [(10, 25, 6),
              (26, 49, 7.1),
              (50, 64, 7.2),
              (65, 79, 7.3),
              (80, 94, 7.4),
              (95, 109, 7.5),
              (110, 124, 7.6),
              (125, 134, 7.7),
              (135, 150, 8),
              (151, 175, 9),
              (176, 201, 10),
              (202, 213, 11),
              (214, 228, 12),
              (229, 254, 13),
              (255, 256, 14)]
REPORTS_FOR_THE_TEST = {
    'content_a1': content_a1,
    'content_a2': content_a2,
    'content_i1': content_i1,
    'content_sh1': content_sh1,
    'content_b1': content_b1,
    'content_b2': content_b2,
    'content_ac1': content_ac,
    'content_g1': content_g1,
    'content_g2': content_g2
}

PATHS_FOR_REPORTS_PDF = {
    'path_a1': '../reports/pdfs/Архангельское_месторождение_Пересчет_запасов_КГ.pdf',
    'path_a2': '../reports/pdfs/Кн.2_Отчёт Архангельское_ПЕЧАТЬ.pdf',
    'path_i1': '../reports/pdfs/Ивинское, книга 1.pdf',
    'path_sh1': '../reports/pdfs/Книга 1 - Щербеньское.pdf',
    'path_g1': '../reports/pdfs/Том 1 Граничное.pdf',
    'path_g2': '../reports/pdfs/2 Граничное.pdf',
    'path_b1': '../reports/pdfs/Книга 1 - Байданкинское.pdf',
    'path_b2': '../reports/pdfs/Книга 2 - Байданкинское.pdf',
    'path_ac': '../reports/pdfs/Отчет_Аканское месторождение.pdf'
}

PATHS_FOR_REPORTS_TXT = {
    'path_a1': '../reports/txt/archangelsk/Архангельское_месторождение_Пересчет_запасов_КГ',
    'path_a2': '../reports/txt/archangelsk/Кн.2_Отчёт Архангельское_ПЕЧАТЬ',
    'path_i1': '../reports/txt/ivinskoe/Ивинское, книга 1',
    'path_sh1': '../reports/txt/sherbenskoe/Книга 1 - Щербеньское',
    'path_g1': '../reports/txt/granichnoe/Том 1 Граничное',
    'path_g2': '../reports/txt/granichnoe/2 Граничное',
    'path_b1': '../reports/txt/baydankinskoe/Книга 1 - Байданкинское',
    'path_b2': '../reports/txt/baydankinskoe/Книга 2 - Байданкинское',
    'path_ac': '../reports/txt/acanskoe/Отчет_Аканское месторождение'
}

CONTENT_A1 = list(range(8))
CONTENT_A2 = list(range(8, 14))
CONTENT_I = list(range(15))
CONTENT_SH = list(range(15))
CONTENT_B1 = [0, 1, 2.1, 2.2, 2.3, 3, 4, 5]
CONTENT_B2 = [6, 7, 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7, 8.8, 9, 10, 11, 12, 13, 14]
CONTENT_AC = list(range(7))
CONTENT_G1 = [0, 1, 2.1, 2.2, 2.3, 3, 4, 5]
CONTENT_G2 = [6, 7.1, 7.2, 7.3, 7.4, 7.5, 7.6, 7.7, 8, 9, 10, 11, 12, 13, 14]

CONTENTS = {
    'content_a1': CONTENT_A1,
    'content_a2': CONTENT_A2,
    'content_i1': CONTENT_I,
    'content_sh1': CONTENT_SH,
    'content_b1': CONTENT_B1,
    'content_b2': CONTENT_B2,
    'content_ac1': CONTENT_AC,
    'content_g1': CONTENT_G1,
    'content_g2': CONTENT_G2
}
